[["Will you continue running my campaign even if it doesn't reach the minimum target number of leads?", "Yes, we will continue running the campaign until we reach the minimum target number of leads, or we can issue a pro-rated credit.", "No, we will not continue running the campaign if it doesn't reach the minimum target number of leads.", "Yes, we will continue running the campaign but with reduced efforts.", "No, we will stop running the campaign immediately."], ["Will TheJobsDriver negatively impact the number of leads I receive?", "No, using TheJobsDriver won't negatively impact the number of leads you receive or cause you to compete with yourself.", "Yes, using TheJobsDriver will decrease the number of leads you receive.", "Using TheJobsDriver will increase the competition and decrease the quality of leads.", "Using TheJobsDriver will decrease the exposure of your job ads."], ["Will using TheJobsDriver on the same job board as the client result in competing with oneself?", "No, using TheJobsDriver to advertise will not result in 'competing with oneself.'", "Yes, using TheJobsDriver will result in competing with oneself.", "Using TheJobsDriver on the same job board will increase the competition with other advertisers.", "Using TheJobsDriver on the same job board will decrease the competition with other advertisers."], ["Will you continue running my campaign even if it doesn't reach the minimum target number of leads?", "True", "False"], ["Why might you not see responses specifically coming from TheJobsDriver?", "You may not see responses specifically coming from TheJobsDriver because it generates interest across various platforms and targets passive talent.", "TheJobsDriver focuses only on active job seekers.", "TheJobsDriver's responses are delayed compared to other platforms.", "TheJobsDriver's responses are limited to specific job boards."], ["Will using TheJobsDriver on the same job board as the client result in competing with oneself?", "False", "True"], ["Why should I choose TheJobsDriver over other marketing companies?", "TheJobsDriver's unique approach combines a diverse range of media sources and algorithm optimization, resulting in high-quality leads.", "Other marketing companies have a higher success rate in generating leads.", "TheJobsDriver offers a lower cost compared to other marketing companies.", "Other marketing companies specialize in targeting passive job seekers."], ["Why would I use TheJobsDriver, when we can do this stuff ourselves?", "TheJobsDriver specializes in giving your recruitment efforts an extra boost to reach a wider and more diverse audience.", "Using TheJobsDriver internally will decrease the time and resources required for recruitment.", "Using TheJobsDriver internally will provide better algorithm optimization.", "TheJobsDriver offers a lower cost compared to handling recruitment efforts internally."]]